; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	infrared2 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	Star8 - direction
	Star3 - direction
	GroundStation10 - direction
	Star5 - direction
	Star7 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star8)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(have_image Planet11 infrared1)
	(have_image Planet12 infrared0)
	(have_image Star13 infrared0)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 infrared2)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation10)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet12 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet12)
   goals met: 0 of 6
5. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 1 of 6
6. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 1 of 6
7. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon14 instrument0 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 3 of 6
10. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 3 of 6
11. (take_image satellite0 planet15 instrument0 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 4 of 6
12. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 4 of 6
13. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 5 of 6
14. (turn_to satellite0 star13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star13)
   goals met: 5 of 6
15. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 6 of 6
